

Картачитача = {
    "ID": "16",
    "Прізвище": "Постоловський",
    "Ім'я": "Максим",
    "Група": "ІПЗс-23-2",
    "Курс":"1",
    "Книги (борг)": [],
    "Статистика книг": []
}

print(Картачитача)
 
while True:
    print("Оберіть дію:")
    print("1. Вивести карту читача")
    print("2. Взяти книгу в борг")
    print("3. Повернути книгу")
    print("0. Вихід з програми")
    
    обране = input("Ваш вибір: ")
    
    
    if обране == "0":
        break
    
    if обране == "1":
        print(Картачитача)
        
    elif обране == "2":
        назвакниги = input("Введіть назву книги яку хочете взяти: ")
        Картачитача ["Книги (борг)"].append(назвакниги)
        print(f"Книга {назвакниги} додана в список боргу")
        
    elif обране =="3":
        списокборгу = Картачитача["Книги (борг)"]
        if not списокборгу:
            print("Ви немаєте книг в боргу")
        else:
            print("Книги в боргу:")
            for книга in списокборгу:
                print(Картачитача["Книги (борг)"])
                книга = input("Введіть назву книги, яку бажаєте повернути: ")
                Картачитача["Книги (борг)"].remove(книга)
                Картачитача["Статистика книг"].append(книга)
                print(Картачитача)